In [1]:
import re
import matplotlib.pyplot as plt
import pandas as pd
import numpy

In [2]:
%matplotlib inline

In [3]:
#!head Data/Master.csv

In [4]:
master = pd.read_csv('Data/Master.csv')

In [5]:
master.head()

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981,12,27,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,205,75,R,R,4/6/2004,9/28/2013,aardd001,aardsda01
1,aaronha01,1934,2,5,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180,72,R,R,4/13/1954,10/3/1976,aaroh101,aaronha01
2,aaronto01,1939,8,5,USA,AL,Mobile,1984,8,16,...,Aaron,Tommie Lee,190,75,R,R,4/10/1962,9/26/1971,aarot101,aaronto01
3,aasedo01,1954,9,8,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190,75,R,R,7/26/1977,10/3/1990,aased001,aasedo01
4,abadan01,1972,8,25,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184,73,L,L,9/10/2001,4/13/2006,abada001,abadan01

In [6]:
batting = pd.read_csv('Data/Batting.csv')

In [7]:
batting.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0,0,0,0,0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13,8,1,4,0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NaN,29,137,28,40,4,...,19,3,1,2,5,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NaN,27,133,28,44,10,...,27,1,1,0,2,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,16,6,2,2,1,NaN,NaN,NaN,NaN,NaN

In [8]:
salary = pd.read_csv('Data/Salaries.csv')

In [9]:
salary.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [10]:
merge1=pd.merge(batting, master)
merge1.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,Abercrombie,Francis Patterson,NaN,NaN,NaN,NaN,1871-10-21,1871-10-21,aberd101,abercda01
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,Addy,Robert Edward,160,68,L,L,1871-05-06,1877-10-06,addyb101,addybo01
2,addybo01,1873,1,PH2,NaN,10,51,12,16,1,...,Addy,Robert Edward,160,68,L,L,1871-05-06,1877-10-06,addyb101,addybo01
3,addybo01,1873,2,BS1,NaN,31,152,37,54,5,...,Addy,Robert Edward,160,68,L,L,1871-05-06,1877-10-06,addyb101,addybo01
4,addybo01,1874,1,HR1,NaN,50,213,25,51,9,...,Addy,Robert Edward,160,68,L,L,1871-05-06,1877-10-06,addyb101,addybo01

In [11]:
merge2=pd.merge(merge1, salary)

In [12]:
len(merge2)

23765

In [13]:
fielding=pd.read_csv('Data/Fielding.csv')

In [14]:
merge3=pd.merge(merge2, fielding)

In [15]:
merge3 = merge3['AB'] > (20)
merge3.head()

0    False
1    False
2    False
3    False
4    False
Name: AB, dtype: bool

In [16]:
appearances = pd.read_csv('data/Appearances.csv')

In [17]:
merge3 = merge3[merge3.yearID == 1996]

AttributeError: 'Series' object has no attribute 'yearID'

In [ ]:

del merge3['weight']
del merge3['height']
del merge3['birthMonth']
del merge3['deathState']
del merge3['deathCountry']
del merge3['deathDay']
del merge3['IBB']
del merge3['birthState']
del merge3['birthCity']
del merge3['deathMonth']
del merge3['birthYear']
del merge3['GIDP']
del merge3['SH']
del merge3['stint']
del merge3['finalGame']
del merge3['debut']

In [ ]:
merge3

In [ ]:
merge3=merge3.drop_duplicates()
merge3.head()

In [ ]:
merge3['OBP'] = (merge3['H']+merge3['BB']+merge3['HBP'])/(merge3['AB']+merge3['BB']+merge3['HBP']+merge3['SF'])

In [ ]:
merge3['ratio'] = merge3['OBP']/merge3['salary']

In [ ]:
dream_team=merge3

In [ ]:
dream_team.head()

In [ ]:
dream_team.sort_ascending = False

In [ ]:
dream_team

In [ ]:
dream_team.reset_index()

In [ ]:
dream_team['worth'] = dream_team['OBP']/dream_team['salary']

In [ ]:
dream_team